content.org
#+hugo_base_dir: .
#+hugo_section: posts
#+hugo_auto_set_lastmod: t

* CSS Stress Test :css:tag:test:
:PROPERTIES:
:EXPORT_HUGO_SECTION: posts
:EXPORT_FILE_NAME: css-stress-test
:EXPORT_DATE: 2025-11-20
:END:
This post serves as a "unit test" for my design language, inspired by the Nier: Automata YoHRa UI. It contains examples of common Org Mode elements to ensure the Hugo CSS handles them correctly.

** Typography and Inline Styles
We need to verify that /italics/, *bold text*, +strikethrough text+, and _underlined text_ render cleanly. We also need to check distinct elements like ~code (tilde)~ and =verbatim (equals)=.

This is the keybinding for ~find-file~: @@html: <kbd>C-x</kbd> <kbd>C-f</kbd>@@

Here is a [[https://orgmode.org][standard hyperlink]] to an external site.

** Lists and Definitions
*** Unordered List
- Level 1 item
- Level 1 item
  - Level 2 item (nested)
  - Level 2 item
    - Level 3 item

*** Ordered List
1. Step One
2. Step Two
   1. Sub-step A
   2. Sub-step B

*** Definition List (The Critical Test)
This uses the standard ~- Term :: Definition~ syntax.
- YoRHa :: An elite military force of androids charged with retaking Earth.
- Bunker :: The orbital base of operations for YoRHa forces.
- 2B :: A battle android deployed to Earth.

** Block Elements
*** Block Quotes
#+begin_quote
"Everything that lives is designed to end. We are perpetually trapped in a never-ending spiral of life and death."
-- 2B, Nier: Automata
#+end_quote

*** Tables
| Unit | Class    | Status | Load |
|------+----------+--------+------|
| 2B   | Battler  | Active | 98%  |
| 9S   | Scanner  | Active | 100% |
| A2   | Attacker | AWOL   | ???  |

** Horizontal Rules
The line below separates sections.
-----
** Admonition System Check
#+begin_warning
**Critical Failure**
If you see this box with a red border and a "WARNING" label, the Elisp filter is working.
#+end_warning

#+begin_note
**Observation**
This should render as a neutral/accent colored note.
#+end_note

#+begin_tip
You can use *bold* and /italics/ inside these blocks because the shortcode uses `markdownify`.
#+end_tip
** Technical Blocks
*** Source Code (Terminal)
#+begin_src python
def mission_status(unit_id):
    """
    Checks the status of a YoRHa unit.
    """
    if unit_id == "9S":
        return "Hacking in progress..."
    return "Combat Mode Engaged"
#+end_src

*** Example Block
This checks the styling for generic examples (often used for output or logs).
#+begin_example
[LOG] Pod 042 reports connection established.
[LOG] Data upload to Bunker complete.
[WARN] Black box signal unstable.
#+end_example
*** Fixed Width (Colon Syntax)
Lines starting with a colon should render as literal text, similar to code but without the wrapper box.

: This is a fixed-width line.
: It should look like a typewriter output.
: No syntax highlighting here.

** Interactive & Meta Elements
*** Collapsible Details (HTML Export)
#+begin_export html
<details>
  <summary>ACCESS CLASSIFIED DATA [CLICK TO EXPAND]</summary>
  <div style="padding-top: 1rem;">
    <p>This data is concealed behind a standard HTML5 details element.</p>
    <ul>
      <li>Hidden Intel A</li>
      <li>Hidden Intel B</li>
    </ul>
  </div>
</details>
#+end_export

  
*** Footnotes & Citations
This is a statement that requires verification[fn:1].
Here is another point that references the same source[fn:1].
**** Footnotes
[fn:1] This is the footnote content. It will jump to the bottom of the page.
